# Sales Growth per Territory


Write a query to return Territory and corresponding Sales Growth. Compare growth between periods Q4-2021 vs Q3-2021.

If Territory (say T123) has Sales worth 100USD in Q3-2021 and Sales worth 110USD in Q4-2021, then the Sales Growth will be 10% [i.e. = ((110 - 100)/100) * 100]

Output the ID of the Territory and the Sales Growth. Only output these territories that had any sales in both quarters.

In [1]:
import pandas as pd
sales=pd.read_csv('fct_customer_sales.csv')
cus_ter=pd.read_csv('map_customer_territory.csv')

In [4]:
sales.order_date=pd.to_datetime(sales.order_date)

In [20]:
q3_sales=sales[(sales.order_date.dt.quarter==3)&(sales.order_date.dt.year==2021)].merge(cus_ter,left_on='ust_id',right_on='cust_id')

In [22]:
q4_sales=sales[(sales.order_date.dt.quarter==4)&(sales.order_date.dt.year==2021)].merge(cus_ter,left_on='ust_id',right_on='cust_id')

In [32]:
total_sales_per_territory_q3=q3_sales.groupby('territory_id').order_value.sum().reset_index(name='total_sales_q3')

In [33]:
total_sales_per_territory_q4=q4_sales.groupby('territory_id').order_value.sum().reset_index(name='total_sales_q4')

In [36]:
q=total_sales_per_territory_q3.merge(total_sales_per_territory_q4)
q

  territory_id  total_sales_q3  total_sales_q4
0           T1            4819            5033
1           T3            3659            6115
2           T4            9363           10988
3           T5            5670            6014

In [40]:
q['sales_growth']=((q.total_sales_q4-q.total_sales_q3)/q.total_sales_q3*100).round()

In [45]:
q['sales_growth']=q.sales_growth.astype(str)+'%'

In [47]:
q

  territory_id  total_sales_q3  total_sales_q4 sales_growth
0           T1            4819            5033         4.0%
1           T3            3659            6115        67.0%
2           T4            9363           10988        17.0%
3           T5            5670            6014         6.0%